/* eslint-disable */
const alphabet = {
	A: '[a|A|Å|å|Ǻ|ǻ|Ḁ|ḁ|ẚ|Ă|ă|Ặ|ặ|Ắ|ắ|Ằ|ằ|Ẳ|ẳ|Ẵ|ẵ|Ȃ|ȃ|Â|â|Ậ|ậ|Ấ|ấ|Ầ|ầ|Ẫ|ẫ|Ẩ|ẩ|Ả|ả|Ǎ|ǎ|Ⱥ|ⱥ|Ȧ|ȧ|Ǡ|ǡ|Ạ|ạ|Ä|ä|Ǟ|ǟ|À|à|Ȁ|ȁ|Á|á|Ā|ā|Ā̀|ā̀|Ã|ã|Ą|ą|Ą́|ą́|Ą̃|ą̃|A̲|a̲|ᶏ]',
	B: '[b|B||Ƀ|ƀ|Ḃ|ḃ|Ḅ|ḅ|Ḇ|ḇ|Ɓ|ɓ|ᵬ|ᶀ]',
	C: '[c|C|Ć|ć|Ĉ|ĉ|Č|č|Ċ|ċ|Ḉ|ḉ|Ƈ|ƈ|C̈|c̈|Ȼ|ȼ|Ç|ç|ꞔ|Ꞓ|ꞓ]',
	D: '[d|D|Đ|đ|Ꟈ|ꟈ[9]|Ɗ|ɗ|Ḋ|ḋ|Ḍ|ḍ|Ḑ|ḑ|Ḓ|ḓ|Ď|ď|Ḏ|ḏ]',
	E: '[e|E|É|é|È|è|Ê|ê|Ḙ|ḙ|Ě|ě|Ĕ|ĕ|Ẽ|ẽ|Ḛ|ḛ|Ẻ|ẻ|Ė|ė|Ë|ë|Ē|ē|Ȩ|ȩ|Ę|ę|ᶒ|Ɇ|ɇ|Ȅ|ȅ|Ế|ế|Ề|ề|Ễ|ễ|Ể|ể|Ḝ|ḝ|Ḗ|ḗ|Ḕ|ḕ|Ȇ|ȇ|Ẹ|ẹ|Ệ|ệ|ⱸ|ᴇ|Ｅ|ｅ|&|ᵫ|ε|3|Յ|ვ|Ȝ|ȝ|ɜ|з|З|ဒ|૩ ]',
	F: '[f|F|Ƒ|ƒ|Ḟ|ḟ|ᵮ|ᶂ]',
	G: '[g|G|4|G|Ǵ|ǵ|Ğ|ğ|Ĝ|ĝ|Ǧ|ǧ|Ġ|ġ|Ģ|ģ|Ḡ|ḡ|Ǥ|ǥ|Ɠ|ɠ|ᶃ|ɢ|Ｇ|ｇ]',
	H: '[h|H|Ĥ|ĥ|Ȟ|ȟ|Ħ|ħ|Ḩ|ḩ|Ⱨ|ⱨ|ẖ|ẖ|Ḥ|ḥ|Ḣ|ḣ|Ḧ|ḧ|Ḫ|ḫ|ꞕ|Ꜧ|ꜧ]',
	I: '[i|I|Ị|ị|Ĭ|ĭ|Î|î|Ǐ|ǐ|Ɨ|ɨ|Ï|ï|Ḯ|ḯ|Í|í|Ì|ì|Ȉ|ȉ|Į|į|Į́|Į̃|Ī|ī|Ī̀|ī̀|ᶖ|Ỉ|ỉ|Ȋ|ȋ|Ĩ|ĩ|Ḭ|ḭ|ᶤ]',
	J: '[j|J|Ĵ|ĵ|ǰ|Ɉ|ɉ|J̃|j̇̃]',
	K: '[k|K||Ƙ|ƙ|Ꝁ|ꝁ|Ḱ|ḱ|Ǩ|ǩ|Ḳ|ḳ|Ķ|ķ|ᶄ|Ⱪ|ⱪ|Ḵ|ḵ]',
	L: '[l|L|Ĺ|ĺ|Ł|ł|Ľ|ľ|Ḹ|ḹ|L̃|l̃|Ļ|ļ|Ŀ|ŀ|Ḷ|ḷ|Ḻ|ḻ|Ḽ|ḽ|Ƚ|ƚ|Ⱡ|ⱡ]',
	M: '[m|M|Ḿ|ḿ|Ṁ|ṁ|Ṃ|ṃ|M̃|m̃|ᵯ]',
	N: '[n|N|Ń|ń|Ǹ|ǹ|Ň|ň|Ñ|ñ|Ṅ|ṅ|Ņ|ņ|Ṇ|ṇ|Ṉ|N̈|n̈|Ɲ|ɲ|Ƞ|ƞ|ᵰ|ᶇ|ɳ|ȵ|ɴＮ|Ŋ]',
	O: '[o|O|0|Ó|ó|Ò|ò|Ŏ|ŏ|Ô|ô|Ố|ố|Ồ|ồ|Ỗ|ỗ|Ổ|ổ|Ǒ|ǒ|Ö|ö|Ȫ|ȫ|Ő|ő|Õ|õ|Ṍ|ṍ|Ṏ|ṏ|Ȭ|ȭ|Ȯ|ȯ|Ȱ|ȱ|Ø|ø|Ǿ|ǿ|Ǫ|ǫ|Ǭ|ǭ|Ō|ō|Ṓ|ṓ|Ō̂|ō̂|Ṑ|ṑ|Ỏ|ỏ|Ȍ|ȍ|Ȏ|ȏ|Ơ|ơ|Ớ|ớ|Ờ|ờ|Ỡ|ỡ|Ở|ở|Ợ|ợ|Ọ|ọ|Ộ|ộ|Ɵ|ɵ|ⱺ|ᴏ|Ｏ|ｏ|Ꝏ|ꝏꝌ|ꝍ]',
	P: '[p|P|Ṕ|ṕ|Ṗ|ṗ|Ᵽ|ᵽ|Ꝑ|ꝑ|Ƥ|ƥ|Ꝓ|ꝓ|Ꝕ|ꝕ|P̃|p̃|ᵱ|ᶈ]',
	Q: '[q|Q|ʠ|Ɋ|ɋ|q̃]',
	R: '[r|R|Ŕ|ŕ|Ř|ř|Ṙ|ṙ|Ŗ|ŗ|Ȑ|ȑ|Ȓ|ȓ|Ṛ|ṛ|Ṝ|ṝ|Ṟ|ṟ|Ɍ|ɍ|Ɽ|ɽ|ᵲ|ᶉ|ɼ|ɾ|ᵳ|Ʀ|ʀ|Ｒ|ｒ]',
	S: '[s|S|Ś|ś|Ṥ|ṥ|Ŝ|ŝ|Š|š|Ṧ|ṧ|Ṡ|ṡ|ẛ|Ş|ş|Ṣ|ṣ|Ṩ|ṩ|Ș|ș|S̩|s̩|ᵴ|ᶊ|ʂ|ȿ|ꜱ|Ｓ|ｓſ|ẞ|ß]',
	T: '[t|T|Ť|ť|Ṫ|ṫ|Ţ|ţ|Ṭ|ṭ|Ț|ț|Ṱ|ṱ|Ṯ|ṯ|Ŧ|ŧ|Ⱦ|ⱦ|Ƭ|ƭ|Ʈ|ʈ|T̈|ẗ|ᵵ|ƫ|ȶ|ᶙ|ᴛ|Ｔ|ｔ]',
	U: '[u|U|Ŭ|ŭ|Ʉ|ʉ|ᵾ|ᶶ|Ụ|ụ|Ü|ü|Ǜ|ǜ|Ǘ|ǘ|Ǚ|ǚ|Ǖ|ǖ|Ṳ|ṳ|Ú|ú|Ù|ù|Û|û|Ṷ|ṷ|Ǔ|ǔ|Ȗ|ȗ|Ű|ű|Ŭ|ŭ|Ư|ư|Ứ|ứ|Ừ|ừ|Ử|ử|Ự|ự|Ữ|Ữ|Ủ|ủ|Ū|ū|Ū̀|ū̀|Ū́|ū́|Ṻ|ṻ|Ū̃|ū̃|Ũ|ũ|Ṹ|ṹ|Ṵ|ṵ|ᶙ|Ų|ų|Ų́|ų́|Ų̃|ų̃|Ȕ|ȕ|Ů|ů]',
	V: '[v|V|Ṽ|ṽ|Ṿ|ṿ|Ʋ|ʋ|ᶌ]',
	W: '[w|W|Ẃ|ẃ|Ẁ|ẁ|Ŵ|ŵ|Ẅ|ẅ|Ẇ|ẇ|Ẉ|ẉ|ẘ]',
	X: '[x|X|Ẍ|ẍ|Ẋ|ẋ|X̂|x̂|ᶍ]',
	Y: '[y|Y|Ý|ý|Ỳ|ỳ|Ŷ|ŷ|Ÿ|ÿ|Ỹ|ỹ|Ẏ|ẏ|Ỵ|ỵ|ẙ|Ỷ|ỷ|Ȳ|ȳ|Ɏ|ɏ|Ƴ|ƴ]',
	Z: '[z|Z|Ź|ź|Ẑ|ẑ|Ž|ž|Ż|ż|Ẓ|ẓ|Ẕ|ẕ|Ƶ|ƶ|ᵶ|Ᶎ|ᶎ|Ⱬ|ⱬ]',
};

export enum Symbols {
	space = '\\s*',
	specialCharacters = '[!@#$&)\\-`.+,"]*',
	plus = '+',
	aster = '*',
}

export default alphabet;
